-- Додаємо тренерів
INSERT INTO Trainers (full_name, specialization) VALUES
('Іван Петренко', 'Кросфіт'),
('Олена Коваленко', 'Йога'),
('Сергій Бойко', 'Тренажерний зал');

-- Додаємо клієнтів
INSERT INTO Members (full_name, phone, join_date) VALUES
('Анна Шевченко', '+380501234567', '2023-01-15'),
('Максим Ткаченко', '+380671234567', '2023-05-20'),
('Вікторія Романенко', '+380631234567', '2023-08-10');

-- Додаємо абонементи
INSERT INTO Memberships (member_id, type, price, start_date, end_date) VALUES
(1, 'Річний', 12000.00, '2023-01-15', '2024-01-15'),
(2, 'Місячний', 1500.00, '2023-05-20', '2023-06-20'),
(3, 'Піврічний', 6500.00, '2023-08-10', '2024-02-10'),
(2, 'Місячний', 1500.00, '2023-06-20', '2023-07-20'); -- Макс купив другий абонемент

-- Додаємо тренування
INSERT INTO Workouts (trainer_id, title, workout_date, max_capacity) VALUES
(1, 'CrossFit Вступ', '2023-09-01 10:00:00', 10),
(2, 'Ранкова Йога', '2023-09-01 08:00:00', 15),
(3, 'Силове тренування', '2023-09-02 18:00:00', 5);

-- Записуємо клієнтів на тренування
INSERT INTO Workout_Registrations (workout_id, member_id) VALUES
(1, 1),
(1, 2),
(2, 3),
(3, 2);